Обработки/Reports/_КредиторскаяЗадолженностьИПрочиеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КредиторскаяЗадолженностьИПрочиеОбязательства</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КредиторскаяЗадолженностьИПрочиеОбязательства/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"НПФ Согласие_Кредиторская задолженность и прочие обязательства",
		"1.21",
		"",
		Истина);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Единый.Расчеты25);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи40);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи41);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи42);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажи43);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД20);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД21);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД22);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеЧерезПСД23);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения19);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения20);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения21);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения22);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения23);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения24);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения25);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолговыеДляПродажиИДоПогашения26);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи32);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДолевыеДляПродажи33);
	СписокСчетов.Добавить(ПланыСчетов.Единый.РасчетыСДебиторамиИКредиторами24);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокСчетов", СписокСчетов);
		
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Единый.ПроцентныеДоходы);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыОтОпераций);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ПрочиеДоходыРасходы);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыРасходыПоОбеспечениюДеятельности);
	СписокСчетов.Добавить(ПланыСчетов.Единый.ДоходыИРасходыПоДеятельностиПоНПО);
		
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокСчетовРаздела7", СписокСчетов);
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Единый.АктивыВДУ03);
		
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокСчетовСАналитикой", СписокСчетов);
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Единый.АктивыВДУ03);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокСчетовДляОборотов", СписокСчетов);

	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Единый.АктивыВДУ);
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Счет479", СписокСчетов); 	
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", 					ЭтотОбъект.Период.ДатаНачала);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", 					Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончанияДляВывода",			ЭтотОбъект.Период.ДатаОкончания);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаИзмененияУчета",				'20170630');
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВалютаРубли",					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета"));
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ПараметрыВыводаПодписей);

	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции
